docs/posts/2017-03-14-usury-in-oklahoma-.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Usury in Oklahoma</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Usury in Oklahoma</h1>
<p class="subtitle" role="doc-subtitle">Mar 14, 2017</p>
</header><p>
Yesterday, the House of Representatives of the State of Oklahoma passed <a href="http://www.oklegislature.gov/BillInfo.aspx?Bill=Hb1913&amp;Session=1700">HB 1913</a>, a bill giving lenders the ability to charge an Annual Percentage Rate of 205.92% on a $1,500 loan.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>

<p>
This bill is inconsistent with historical Christian values and should be opposed by conservatives and progressives alike. The practice of taking interest on loans is expressly forbidden in several passages of Scripture:
</p>

<ul class="org-ul">
<li>Exodus 22:25-27</li>
<li>Leviticus 25:35-38</li>
<li>Deuteronomy 23:19-20; 24:6</li>
<li>Psalm 15:5</li>
<li>Ezekiel 18:7-8; 22:12</li>
<li>Nehemiah 5:6-13<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup></li>
</ul>

<p>
Before 1500, every Christian writer who discussed the practice expressly condemned the practice of charging interest. Ambrose called it wicked, and Augustine, in the <i>Enarration on Psalm 129</i> said that the person who loaned at interest would &ldquo;&#x2026;go into the flame.&rdquo; Like the church fathers, every church council that discussed loaning at interest condemned it. Luther also condemned charging interest, although Calvin did not. Calvin saw interest as a necessity in a fallen world, since the lender is risking non-payment. Interestingly, though, in his <i>Commentary on the First Twenty Chapters of Ezekiel</i>, he said &ldquo;It is always wrong to exact usury from a poor man.&rdquo; For Calvin, it looks like interest can be charged, just not to the poor. One could also appeal to the Founding Fathers. The colonies set an interest cap of 8%. After 1776, most states limited interest at 6%.
</p>

<p>
Note that the Bible and the Church for the first 1600 years of its existence defined usury simply as charging interest on a loan. We now define it as charging excessive interest, which shows a compromise to the modern world. Regardless, taking a stand against this bill is taking a stand for traditional Christian values; something the right should certainly support.
</p>

<div class="tagline" id="orgb13bc6a">
<p>
Tagged: <a href="../tags/religion.html">Religion</a> <a href="../tags/politics.html">Politics</a>
</p>

</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes</h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
The full text of the bill in its various versions can be found <a href="http://www.oklegislature.gov/BillInfo.aspx?Bill=Hb1913&amp;Session=1700">here</a>. It was sponsored by <a href="https://www.facebook.com/pg/Chris-Kannady-for-House-91-1406719546213093/about/?ref=page_internal">Rep. Chris Kannady</a>. It is surprising that a veteran should sponsor a bill like this, given that young soldiers are often targets for predatory lenders. The bill passed <a href="http://www.okhouse.gov/56LEG/OKH00208.TXT">59-31</a>. Note that the bill allows a 17% monthly rate, equivalent to a 206% annual rate.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Strictly speaking, these passages forbid taking interest from fellow Israelites. Christians should be willing to expand this, given Jesus&rsquo; expansion of our understanding of neighbor.
</p></div></div>


</div>
</div></main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
